"use client";

import Link from "next/link";
import Image from "next/image";
import { useEffect, createRef, useState } from "react";
import Carousel from "react-multi-carousel";
import "react-multi-carousel/lib/styles.css";

import styles from "./page.module.scss";

type CurrentLink = "home" | "about" | "clients" | "services" | "contacts";

export default function Home() {
  const carouselRef = createRef<Carousel>();

  const [isShow, setIsShow] = useState(false);

  function handleScrollTo(currentLink: CurrentLink) {
    return () => {
      if (window.innerWidth <= 1024) setIsShow(false);

      const currentElement = document.getElementById(currentLink);

      currentElement?.scrollIntoView({ behavior: "smooth" });
    };
  }

  function handleNextSlide() {
    const col = window.innerWidth <= 1024 ? 1 : 3;

    if (
      (carouselRef.current?.state.totalItems as number) - col ===
      carouselRef.current?.state.currentSlide
    )
      return carouselRef.current?.goToSlide(0);

    return carouselRef.current?.next(1);
  }

  function handlePreviousSlide() {
    carouselRef.current?.previous(1);
  }

  function handleToggle() {
    setIsShow((prev) => !prev);
  }

  function headerManipulation() {
    const header = document.getElementById("header");

    let positionY = (
      document.documentElement ||
      document.body.parentNode ||
      document.body
    ).scrollTop;

    if (header?.style) {
      if (positionY >= 80) header.classList.add(styles.bg);
      else header.classList.remove(styles.bg);
    }
  }

  useEffect(() => {
    window.addEventListener("scroll", headerManipulation);

    return () => {
      window.removeEventListener("scroll", headerManipulation);
    };
  }, []);

  return (
    <div className="">
      <header
        className={[
          styles.header,
          !isShow ? "" : [styles.show, styles.bg].join(" "),
        ].join(" ")}
        id="header"
      >
        <div className={styles.container}>
          <div className={styles.inner}>
            <Link className={styles.logo} href="/">
              <svg
                width="396"
                height="55"
                viewBox="0 0 396 55"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M39.101 54.7089L45.7118 33.8542H38.9648L45.5692 13.0577L29.0681 33.8542H21.4527L18.2445 13.0577L11.6467 33.8542H0L10.5578 0.582397H27.2209L30.1958 19.593L45.4071 0.582397H61.3508L51.5902 31.3501L57.7279 31.3047L39.101 54.7089Z"
                  fill="white"
                />
                <path
                  d="M91.0605 0C108.845 0 109.48 9.57 107.263 16.4612L106.836 17.8006C104.677 24.6012 97.9306 34.4365 80.1009 34.4365H78.0852C60.3462 34.4365 59.75 24.6012 61.8823 17.8006L62.31 16.4612C64.5071 9.52471 71.2929 0 88.9866 0H91.0605ZM94.5474 16.8235C95.5714 13.5882 95.5844 9.05882 87.1653 9.05882C78.7463 9.05882 75.9075 13.5882 74.8511 16.8235L74.6956 17.3153C73.6715 20.5506 73.6456 25.2806 82.0258 25.2806C90.4059 25.2806 93.3354 20.5376 94.34 17.3153L94.5474 16.8235Z"
                  fill="white"
                />
                <path
                  d="M130.479 0.582419L122.916 24.4006H142.845L139.851 33.8412H107.821L118.385 0.562988L130.479 0.582419Z"
                  fill="white"
                />
                <path
                  d="M163.682 14.6948L157.59 33.8865H145.814L156.371 0.608276H168.686L180.741 19.2177L186.645 0.608276H198.428L187.87 33.8865H176.269L163.682 14.6948Z"
                  fill="white"
                />
                <path
                  d="M207.501 33.8606H195.408L205.972 0.582397H218.066L207.501 33.8606Z"
                  fill="white"
                />
                <path
                  d="M232.862 34.3978C215.123 34.3978 215.532 27.4613 216.938 23.0354L217.022 22.7636H229.985C229.725 24.0189 229.337 26.7042 235.591 26.7042H235.857C241.904 26.7042 243.271 25.0931 243.725 23.6631C244.217 22.0972 243.679 20.9778 238.3 20.8419L233.685 20.706C221.371 20.486 219.628 15.8789 221.319 10.5536L221.429 10.1978C223.251 4.47127 228.3 0.135986 242.817 0.135986H244.762C260.757 0.135986 261.548 5.68127 259.999 10.5536L259.934 10.7801H247.166C247.354 9.486 247.095 7.60306 241.541 7.60306H241.204C235.831 7.60306 234.47 8.63188 234.003 10.1072C233.536 11.5825 234.165 12.5725 239.136 12.6954L243.9 12.786C256.778 13.1419 258.541 16.9013 256.668 22.8025L256.499 23.3395C254.795 28.7101 250.439 34.3913 233.996 34.3913L232.862 34.3978Z"
                  fill="white"
                />
                <path
                  d="M292.023 0C309.807 0 310.442 9.57 308.225 16.4612L307.798 17.8006C305.639 24.6012 298.893 34.4365 281.063 34.4365H279.047C261.308 34.4365 260.712 24.6012 262.844 17.8006L263.272 16.4612C265.469 9.52471 272.255 0 289.949 0H292.023ZM295.509 16.8235C296.533 13.5882 296.546 9.05882 288.127 9.05882C279.708 9.05882 276.87 13.5882 275.845 16.8235L275.69 17.3153C274.666 20.5506 274.64 25.2806 283.02 25.2806C291.4 25.2806 294.349 20.5182 295.354 17.2829L295.509 16.8235Z"
                  fill="white"
                />
                <path
                  d="M352.272 0.582397L349.679 8.81297H328.829L327.267 13.7306H347.495L344.844 22.0971H324.636L320.903 33.8606H308.809L319.373 0.582397H352.272Z"
                  fill="white"
                />
                <path
                  d="M367.548 9.75121H354.203L357.113 0.582397H395.857L392.947 9.75121H379.603L371.948 33.8606H359.9L367.548 9.75121Z"
                  fill="white"
                />
              </svg>
            </Link>

            <nav className={styles.navigation}>
              <button
                onClick={handleScrollTo("home")}
                data-active
                className={styles.link}
              >
                Главная
              </button>
              <button onClick={handleScrollTo("about")} className={styles.link}>
                О нас
              </button>
              <button
                onClick={handleScrollTo("clients")}
                className={styles.link}
              >
                Наши клиенты
              </button>
              <button
                onClick={handleScrollTo("services")}
                className={styles.link}
              >
                Наши услуги
              </button>
              <button
                onClick={handleScrollTo("contacts")}
                className={styles.link}
              >
                Контакты
              </button>
            </nav>

            <button onClick={handleToggle} className={styles.button}>
              <svg
                width="26"
                height="18"
                viewBox="0 0 26 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1 1H25"
                  stroke="white"
                  strokeWidth="2"
                  strokeLinecap="round"
                />
                <path
                  d="M1 9H25"
                  stroke="white"
                  strokeWidth="2"
                  strokeLinecap="round"
                />
                <path
                  d="M1 17H25"
                  stroke="white"
                  strokeWidth="2"
                  strokeLinecap="round"
                />
              </svg>
            </button>
          </div>
        </div>
      </header>

      <div id="home"></div>
      <main className={styles.main}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <h1 className={styles.title}>
              Студия полного цикла по <br /> разработке компьютерной графики
            </h1>

            <button
              onClick={handleScrollTo("services")}
              className={styles.button}
            >
              <div className={styles.background}></div>
              <span className={styles.text}>Связаться с нами</span>
            </button>
          </div>
        </div>
      </main>

      <div id="about"></div>
      <div className={styles.about}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <h1 className={styles.title}>Мы создаем виртуальные миры </h1>

            <div className={styles.image}>
              <div className={styles.blur}></div>
              <Image src={require("@/assets/images/about.png")} alt="" />
            </div>

            <div className={styles.content}>
              <p className={styles.title}>
                Molnisoft - международная аутсорс студия в сфере CG-разработки.
                Мы специализирующаяся на разработке игр, инжиниринге,
                портировании, артах и анимации, DevOps, VR и AR-разработке.
                <br />
                <br />
                Уже более пяти лет, наша команда покоряет игровую индустрию,
                создавая уникальные проекты. Мы стремимся к тому, чтобы быть
                эффективными, делая больше и лучше в каждом отдельном
                направлении.
                <br />
                <br />
                Наша главная цель - качественная реализация ваших идей!
              </p>

              <div className={styles.cards}>
                <div className={styles.card}>
                  <h1 className={styles.number}>5</h1>

                  <p className={styles.text}>лет в разработке</p>
                </div>

                <div className={styles.card}>
                  <h1 className={styles.number}>70+</h1>

                  <p className={styles.text}>выполненных проектов</p>
                </div>

                <div className={styles.card}>
                  <h1 className={styles.number}>30+</h1>

                  <p className={styles.text}>художников и разработчиков</p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div id="clients"></div>
      <div className={styles.partners}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <h1 className={styles.title}>Нам доверяют лучшие</h1>

            <div className={styles.cards}>
              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/1.png")} alt="" />
              </div>

              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/2.png")} alt="" />
              </div>

              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/3.png")} alt="" />
              </div>

              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/4.png")} alt="" />
              </div>

              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/5.png")} alt="" />
              </div>

              <div className={styles.card}>
                <Image src={require("@/assets/images/partners/6.png")} alt="" />
              </div>
            </div>
          </div>
        </div>
      </div>

      <div id="services"></div>
      <div className={styles.services}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <div className={styles.top}>
              <h1 className={styles.title}>
                МЫ ПРЕДОСТАВЛЯЕМ ШИРОКИЙ СПЕКТР УСЛУГ
              </h1>

              <Link href="#" className={styles.button}>
                <div className={styles.background}></div>
                <span className={styles.text}>Связаться с нами</span>
              </Link>
            </div>

            <div className={styles.cards}>
              <div className={styles.card}>
                <div className={styles.icon}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="30"
                    height="48"
                    viewBox="0 0 30 48"
                    fill="none"
                  >
                    <path
                      opacity="0.987"
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M18.8867 0C19.2853 0 19.6839 0 20.0826 0C20.9075 0.429492 21.1899 1.08574 20.9296 1.96875C19.4685 7.43592 18.0234 12.9047 16.5945 18.375C20.7471 18.3593 24.8995 18.375 29.0518 18.4219C29.8904 18.8295 30.1727 19.4701 29.8989 20.3438C23.8446 29.4533 17.7655 38.5471 11.6615 47.625C11.4606 47.7372 11.2779 47.8622 11.1133 48C10.7147 48 10.3161 48 9.91744 48C9.09247 47.5705 8.81014 46.9143 9.07035 46.0312C10.5315 40.564 11.9766 35.0953 13.4055 29.625C9.25292 29.6407 5.10047 29.625 0.948225 29.5781C0.109603 29.1705 -0.172728 28.5299 0.101132 27.6562C6.15535 18.5467 12.2345 9.45291 18.3385 0.375C18.5394 0.262821 18.7221 0.13782 18.8867 0Z"
                      fill="#8080FF"
                    />
                  </svg>
                </div>

                <p className={styles.title}>
                  3D-графика: Разработка реалистичных и стилизованных 3D-моделей
                  для игр, кино и рекламы.
                </p>
              </div>

              <div className={styles.card}>
                <div className={styles.icon}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="30"
                    height="48"
                    viewBox="0 0 30 48"
                    fill="none"
                  >
                    <path
                      opacity="0.987"
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M18.8867 0C19.2853 0 19.6839 0 20.0826 0C20.9075 0.429492 21.1899 1.08574 20.9296 1.96875C19.4685 7.43592 18.0234 12.9047 16.5945 18.375C20.7471 18.3593 24.8995 18.375 29.0518 18.4219C29.8904 18.8295 30.1727 19.4701 29.8989 20.3438C23.8446 29.4533 17.7655 38.5471 11.6615 47.625C11.4606 47.7372 11.2779 47.8622 11.1133 48C10.7147 48 10.3161 48 9.91744 48C9.09247 47.5705 8.81014 46.9143 9.07035 46.0312C10.5315 40.564 11.9766 35.0953 13.4055 29.625C9.25292 29.6407 5.10047 29.625 0.948225 29.5781C0.109603 29.1705 -0.172728 28.5299 0.101132 27.6562C6.15535 18.5467 12.2345 9.45291 18.3385 0.375C18.5394 0.262821 18.7221 0.13782 18.8867 0Z"
                      fill="#8080FF"
                    />
                  </svg>
                </div>

                <p className={styles.title}>
                  2D-графика: Отрисовка концептов и иллюстраций. Создание
                  уникальных графических решений от локаций и персонажей до
                  интерфейсов и конок.
                </p>
              </div>

              <div className={styles.card}>
                <div className={styles.icon}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="30"
                    height="48"
                    viewBox="0 0 30 48"
                    fill="none"
                  >
                    <path
                      opacity="0.987"
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M18.8867 0C19.2853 0 19.6839 0 20.0826 0C20.9075 0.429492 21.1899 1.08574 20.9296 1.96875C19.4685 7.43592 18.0234 12.9047 16.5945 18.375C20.7471 18.3593 24.8995 18.375 29.0518 18.4219C29.8904 18.8295 30.1727 19.4701 29.8989 20.3438C23.8446 29.4533 17.7655 38.5471 11.6615 47.625C11.4606 47.7372 11.2779 47.8622 11.1133 48C10.7147 48 10.3161 48 9.91744 48C9.09247 47.5705 8.81014 46.9143 9.07035 46.0312C10.5315 40.564 11.9766 35.0953 13.4055 29.625C9.25292 29.6407 5.10047 29.625 0.948225 29.5781C0.109603 29.1705 -0.172728 28.5299 0.101132 27.6562C6.15535 18.5467 12.2345 9.45291 18.3385 0.375C18.5394 0.262821 18.7221 0.13782 18.8867 0Z"
                      fill="#8080FF"
                    />
                  </svg>
                </div>

                <p className={styles.title}>
                  Анимация: Создание комплексной анимации персонажей, пропсов и
                  элементов окружения под любые технические требования.
                </p>
              </div>

              <div className={styles.card}>
                <div className={styles.icon}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="30"
                    height="48"
                    viewBox="0 0 30 48"
                    fill="none"
                  >
                    <path
                      opacity="0.987"
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M18.8867 0C19.2853 0 19.6839 0 20.0826 0C20.9075 0.429492 21.1899 1.08574 20.9296 1.96875C19.4685 7.43592 18.0234 12.9047 16.5945 18.375C20.7471 18.3593 24.8995 18.375 29.0518 18.4219C29.8904 18.8295 30.1727 19.4701 29.8989 20.3438C23.8446 29.4533 17.7655 38.5471 11.6615 47.625C11.4606 47.7372 11.2779 47.8622 11.1133 48C10.7147 48 10.3161 48 9.91744 48C9.09247 47.5705 8.81014 46.9143 9.07035 46.0312C10.5315 40.564 11.9766 35.0953 13.4055 29.625C9.25292 29.6407 5.10047 29.625 0.948225 29.5781C0.109603 29.1705 -0.172728 28.5299 0.101132 27.6562C6.15535 18.5467 12.2345 9.45291 18.3385 0.375C18.5394 0.262821 18.7221 0.13782 18.8867 0Z"
                      fill="#8080FF"
                    />
                  </svg>
                </div>

                <p className={styles.title}>
                  Разработка: Полный цикл разработки игр. Реализация ваших идей
                  нашими опытными специалистами.
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div className={styles.portfolio}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <div className={styles.top}>
              <h1 className={styles.title}>портфолио, которым мы гордимся</h1>

              <div className={styles.arrows}>
                <button className={styles.left} onClick={handlePreviousSlide}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="64"
                    height="64"
                    viewBox="0 0 64 64"
                    fill="none"
                  >
                    <circle
                      cx="32"
                      cy="32"
                      r="32"
                      transform="matrix(-1 0 0 1 64 0)"
                      fill="#23232A"
                    />
                    <path
                      d="M45 32.5H18.5M18.5 32.5L27 24M18.5 32.5L27 41"
                      stroke="white"
                      strokeWidth="3"
                    />
                  </svg>
                </button>
                <button className={styles.right} onClick={handleNextSlide}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="64"
                    height="64"
                    viewBox="0 0 64 64"
                    fill="none"
                  >
                    <circle cx="32" cy="32" r="32" fill="#23232A" />
                    <path
                      d="M19 32.5H45.5M45.5 32.5L37 24M45.5 32.5L37 41"
                      stroke="white"
                      strokeWidth="3"
                    />
                  </svg>
                </button>
              </div>
            </div>

            <Carousel
              ref={carouselRef}
              arrows={false}
              customTransition="all ease-out 0.3s"
              responsive={{
                desktop: {
                  breakpoint: { max: 3000, min: 1024 },
                  items: 3,
                  slidesToSlide: 1,
                },
                tablet: {
                  breakpoint: { max: 1024, min: 0 },
                  items: 1,
                  slidesToSlide: 1,
                },
              }}
              className={styles.cards}
            >
              {Array(10)
                .fill("")
                .map((_, index) => (
                  <div key={index} className={styles.card}>
                    <div className={styles.image}>
                      <Image
                        src={require("@/assets/images/portfolio/1.png")}
                        alt=""
                      />
                    </div>

                    <h1 className={styles.title}>
                      Заголовок портфолио {index + 1}
                    </h1>

                    <p className={styles.description}>
                      Lorem Ipsum - это текст-рыба, часто используемый в печати
                      и вэб-дизайне. Lorem Ipsum является стандартной рыбой для
                      текстов на латинице с начала XVI века.
                    </p>

                    <Link href="#" className={styles.button}>
                      <div className={styles.background}></div>
                      <span className={styles.text}>Просмотреть работу</span>
                    </Link>
                  </div>
                ))}
            </Carousel>

            <div className={styles.arrows}>
              <button className={styles.left} onClick={handlePreviousSlide}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="64"
                  height="64"
                  viewBox="0 0 64 64"
                  fill="none"
                >
                  <circle
                    cx="32"
                    cy="32"
                    r="32"
                    transform="matrix(-1 0 0 1 64 0)"
                    fill="#23232A"
                  />
                  <path
                    d="M45 32.5H18.5M18.5 32.5L27 24M18.5 32.5L27 41"
                    stroke="white"
                    strokeWidth="3"
                  />
                </svg>
              </button>
              <button className={styles.right} onClick={handleNextSlide}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="64"
                  height="64"
                  viewBox="0 0 64 64"
                  fill="none"
                >
                  <circle cx="32" cy="32" r="32" fill="#23232A" />
                  <path
                    d="M19 32.5H45.5M45.5 32.5L37 24M45.5 32.5L37 41"
                    stroke="white"
                    strokeWidth="3"
                  />
                </svg>
              </button>
            </div>
          </div>
        </div>
      </div>

      <div id="contacts"></div>
      <div className={styles.feedback}>
        <div className={styles.container}>
          <div className={styles.inner}>
            <h1 className={styles.title}>
              Связаться с нами для дальнейшего сотрудничества
            </h1>

            <div className={styles.contacts}>
              <div className={styles.info}>
                <Link href={"/#"}>
                  <div className={styles.icon}>
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <g clipPath="url(#clip0_48_453)">
                        <path
                          opacity="0.984"
                          fillRule="evenodd"
                          clipRule="evenodd"
                          d="M23.9766 5.17969C23.9766 9.71095 23.9766 14.2422 23.9766 18.7734C23.7351 19.6164 23.1882 20.1555 22.3359 20.3906C15.4297 20.4219 8.52342 20.4219 1.61719 20.3906C0.76492 20.1555 0.218046 19.6164 -0.0234375 18.7734C-0.0234375 14.2422 -0.0234375 9.71095 -0.0234375 5.17969C0.218046 4.33667 0.76492 3.79761 1.61719 3.5625C8.52342 3.53125 15.4297 3.53125 22.3359 3.5625C23.1882 3.79761 23.7351 4.33667 23.9766 5.17969ZM2.46094 4.99219C8.79684 4.93753 15.1406 4.9297 21.4922 4.96875C18.7565 7.72003 16.0065 10.4544 13.2422 13.1719C12.3984 13.7656 11.5547 13.7656 10.7109 13.1719C7.95281 10.4528 5.2028 7.72622 2.46094 4.99219ZM1.38281 6.02344C3.41176 7.97424 5.41177 9.9586 7.38281 11.9766C5.39906 13.9838 3.40689 15.9837 1.40625 17.9766C1.38281 13.9922 1.375 10.0079 1.38281 6.02344ZM22.5234 6.02344C22.5781 9.99994 22.5859 13.9843 22.5469 17.9766C20.5462 15.9837 18.5541 13.9838 16.5703 11.9766C18.5413 9.9743 20.5257 7.98994 22.5234 6.02344ZM8.41406 13.0547C8.79272 13.3628 9.15211 13.6988 9.49219 14.0625C11.1484 15.4063 12.8047 15.4063 14.4609 14.0625C14.7975 13.7181 15.1413 13.3821 15.4922 13.0547C17.5137 15.0058 19.5137 16.9824 21.4922 18.9844C15.1485 19.0156 8.80467 19.0156 2.46094 18.9844C4.44039 16.9971 6.42478 15.0205 8.41406 13.0547Z"
                          fill="white"
                        />
                      </g>
                      <defs>
                        <clipPath id="clip0_48_453">
                          <rect width="24" height="24" fill="white" />
                        </clipPath>
                      </defs>
                    </svg>
                  </div>

                  <span>chto@mail.ru</span>
                </Link>

                <Link href={"/#"}>
                  <div className={styles.icon}>
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <g clipPath="url(#clip0_48_456)">
                        <path
                          opacity="0.962"
                          fillRule="evenodd"
                          clipRule="evenodd"
                          d="M5.50781 0.726464C6.13524 0.669112 6.64303 0.887864 7.03125 1.38271C8.11088 2.85351 9.04838 4.416 9.84375 6.07021C9.981 6.38489 10.067 6.71301 10.1016 7.05459C10.09 7.26904 10.0353 7.47215 9.9375 7.66396C9.76153 7.93387 9.5506 8.17607 9.30469 8.39053C8.91408 8.71865 8.52342 9.04678 8.13281 9.3749C9.28125 12.5234 11.4297 14.6718 14.5781 15.8202C15.0681 15.1897 15.6071 14.6037 16.1953 14.0624C16.6168 13.8203 17.0543 13.789 17.5078 13.9687C18.6253 14.4336 19.6877 14.9961 20.6953 15.6562C21.3203 16.078 21.9453 16.4999 22.5703 16.9218C23.2337 17.4576 23.3821 18.1061 23.0156 18.8671C22.3551 19.7465 21.5973 20.5355 20.7422 21.2343C19.8503 22.0006 18.8816 22.6568 17.8359 23.203C17.0528 23.2277 16.2872 23.1184 15.5391 22.8749C13.692 22.2794 11.9732 21.4357 10.3828 20.3437C6.63924 17.7567 3.77206 14.4207 1.78125 10.3358C1.29565 9.2384 0.951906 8.09775 0.750001 6.91396C0.71875 6.64832 0.71875 6.38273 0.750001 6.11709C1.78761 4.20383 3.13917 2.53977 4.80469 1.1249C5.02828 0.966417 5.26266 0.833606 5.50781 0.726464ZM5.74219 2.32021C6.83414 3.74446 7.75603 5.28351 8.50781 6.9374C8.14149 7.33973 7.73522 7.69912 7.28906 8.01553C6.96417 8.30109 6.68292 8.62143 6.44531 8.97646C7.30083 12.2767 9.2071 14.7689 12.1641 16.453C13.0448 16.9575 13.9823 17.3091 14.9766 17.5077C15.3316 17.2701 15.6519 16.9889 15.9375 16.664C16.2539 16.2178 16.6133 15.8115 17.0156 15.4452C18.6585 16.1996 20.1975 17.1137 21.6328 18.1874C20.4273 19.5343 19.0679 20.6905 17.5547 21.6562C17.0604 21.6511 16.576 21.573 16.1016 21.4218C14.1614 20.8111 12.3801 19.9049 10.7578 18.703C7.90411 16.6155 5.59941 14.0452 3.84375 10.9921C3.19343 9.82232 2.70906 8.58792 2.39063 7.28896C2.31303 6.99571 2.28178 6.69885 2.29688 6.39834C3.26429 4.8914 4.41272 3.53201 5.74219 2.32021Z"
                          fill="white"
                        />
                      </g>
                      <defs>
                        <clipPath id="clip0_48_456">
                          <rect width="24" height="24" fill="white" />
                        </clipPath>
                      </defs>
                    </svg>
                  </div>

                  <span>+7 (323) 312-32-32</span>
                </Link>

                <Link href={"/#"}>
                  <div className={styles.icon}>
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                    >
                      <g clipPath="url(#clip0_48_459)">
                        <path
                          opacity="0.965"
                          fillRule="evenodd"
                          clipRule="evenodd"
                          d="M11.5547 0.7265C14.2559 0.627856 16.3575 1.69036 17.8594 3.914C18.9982 5.85308 19.2326 7.89992 18.5625 10.0546C18.0683 11.6366 17.373 13.121 16.4765 14.5078C18.0715 14.7815 19.6027 15.258 21.0703 15.9374C21.93 16.344 22.594 16.9611 23.0625 17.789C23.4231 18.7719 23.2513 19.6469 22.5469 20.414C21.8946 21.0256 21.1525 21.5022 20.3203 21.8437C18.146 22.6629 15.896 23.1161 13.5703 23.2031C10.8785 23.3603 8.22224 23.126 5.60155 22.4999C4.51734 22.2233 3.48609 21.817 2.5078 21.2812C1.76051 20.8776 1.20582 20.2917 0.843736 19.5234C0.575329 18.665 0.715954 17.8838 1.26561 17.1796C2.04812 16.367 2.97781 15.781 4.05467 15.4218C5.14574 15.0436 6.25513 14.7468 7.3828 14.5312C6.4101 13.0152 5.69919 11.3824 5.24999 9.63275C4.47785 5.63755 5.93877 2.81724 9.6328 1.17181C10.2644 0.955208 10.905 0.806769 11.5547 0.7265ZM12.1172 2.2265C14.4279 2.40106 16.0608 3.54169 17.0156 5.64837C17.5286 7.05195 17.5286 8.4582 17.0156 9.86712C16.5087 11.2871 15.8525 12.6309 15.0469 13.8984C14.1146 15.3249 13.0911 16.6843 11.9765 17.9765C10.0066 15.8882 8.43627 13.5288 7.26561 10.8984C6.6807 9.52962 6.47755 8.10777 6.65624 6.63275C6.87875 5.47634 7.43342 4.51542 8.3203 3.74994C9.41089 2.80568 10.6765 2.29786 12.1172 2.2265ZM15.4922 15.9609C16.9746 16.1518 18.4122 16.519 19.8047 17.0624C20.4358 17.319 20.9905 17.6863 21.4687 18.164C21.7074 18.4724 21.7386 18.8005 21.5625 19.1484C21.317 19.4548 21.0279 19.7126 20.6953 19.9218C19.7183 20.4507 18.687 20.8413 17.6015 21.0937C13.7205 21.9353 9.84552 21.9041 5.97655 20.9999C4.90784 20.7325 3.90784 20.3106 2.97655 19.7343C2.02789 19.031 2.04351 18.3435 3.02342 17.6718C3.94131 17.1105 4.9257 16.7042 5.97655 16.4531C6.77253 16.228 7.57724 16.0952 8.39061 16.0546C9.45575 17.55 10.6511 18.9407 11.9765 20.2265C13.2943 18.9158 14.4661 17.4939 15.4922 15.9609Z"
                          fill="white"
                        />
                        <path
                          opacity="0.964"
                          fillRule="evenodd"
                          clipRule="evenodd"
                          d="M11.5547 4.57029C13.3609 4.49173 14.4938 5.31987 14.9531 7.05467C15.1223 8.84998 14.3489 10.0141 12.6328 10.5469C11.0639 10.7742 9.91543 10.1882 9.18751 8.78904C8.65478 7.15268 9.10009 5.86362 10.5234 4.92185C10.8578 4.7606 11.2015 4.64342 11.5547 4.57029ZM11.6953 6.11717C10.8148 6.40882 10.4319 7.0182 10.5469 7.94529C10.8249 8.7289 11.3795 9.09607 12.2109 9.04685C13.1305 8.79424 13.529 8.1927 13.4063 7.24217C13.1295 6.42762 12.5591 6.05262 11.6953 6.11717Z"
                          fill="white"
                        />
                      </g>
                      <defs>
                        <clipPath id="clip0_48_459">
                          <rect width="24" height="24" fill="white" />
                        </clipPath>
                      </defs>
                    </svg>
                  </div>

                  <span>
                    Астана, ул. Керей, Жанибек хандар, 14/2, офис 47, 010017
                  </span>
                </Link>
              </div>

              <div className={styles.social}>
                <Link href={"/#"}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <g clipPath="url(#clip0_48_477)">
                      <path
                        opacity="0.985"
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M5.22656 -0.0234375C9.72656 -0.0234375 14.2266 -0.0234375 18.7266 -0.0234375C21.6487 0.554967 23.3987 2.30497 23.9766 5.22656C23.9766 9.72656 23.9766 14.2266 23.9766 18.7266C23.3985 21.6484 21.6484 23.3985 18.7266 23.9766C14.2266 23.9766 9.72656 23.9766 5.22656 23.9766C2.30469 23.3985 0.554686 21.6484 -0.0234375 18.7266C-0.0234375 14.2266 -0.0234375 9.72656 -0.0234375 5.22656C0.554409 2.30497 2.30441 0.554967 5.22656 -0.0234375ZM5.64844 1.99219C9.86723 1.98437 14.086 1.99219 18.3047 2.01562C19.8867 2.20747 21.0038 3.02779 21.6562 4.47656C21.8091 4.86919 21.9029 5.27545 21.9375 5.69531C21.9688 9.8828 21.9688 14.0703 21.9375 18.2578C21.7644 19.8626 20.9441 20.9954 19.4766 21.6562C19.0983 21.8016 18.7077 21.8954 18.3047 21.9375C14.0859 21.9688 9.86719 21.9688 5.64844 21.9375C4.06646 21.7456 2.94927 20.9253 2.29688 19.4766C2.14403 19.0839 2.05028 18.6777 2.01562 18.2578C1.96969 13.9442 1.98531 9.63173 2.0625 5.32031C2.51623 3.40545 3.71154 2.29608 5.64844 1.99219Z"
                        fill="white"
                      />
                      <path
                        opacity="0.963"
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M18.1641 3.96095C19.4207 3.92852 20.0223 4.53789 19.9687 5.78907C19.6218 6.80251 18.9265 7.16968 17.8828 6.89063C17.1201 6.49796 16.831 5.88076 17.0156 5.03907C17.2059 4.47181 17.5887 4.11243 18.1641 3.96095Z"
                        fill="white"
                      />
                      <path
                        opacity="0.974"
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M11.2266 5.97648C13.3939 5.80019 15.1986 6.51892 16.6406 8.13273C18.0658 10.0283 18.3627 12.0908 17.5312 14.3202C16.2537 16.94 14.1522 18.151 11.2266 17.953C8.87563 17.5706 7.24279 16.2815 6.32811 14.0859C5.50611 11.4433 6.10771 9.18545 8.1328 7.31242C9.04996 6.59584 10.0812 6.15053 11.2266 5.97648ZM11.6484 7.99211C10.0739 8.19901 8.95668 9.02716 8.29686 10.4765C7.69152 12.2504 8.07435 13.7739 9.4453 15.0468C11.0378 16.2074 12.6628 16.2543 14.3203 15.1874C15.6428 14.1265 16.1506 12.7592 15.8437 11.0859C15.2117 9.02514 13.8133 7.99389 11.6484 7.99211Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_48_477">
                        <rect width="24" height="24" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </Link>

                <Link href={"/#"}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <g clipPath="url(#clip0_48_484)">
                      <path
                        opacity="0.963"
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M23.9766 3.02354C23.9766 3.35166 23.9766 3.67979 23.9766 4.00791C22.836 9.5469 21.7031 15.0938 20.5781 20.6485C20.0418 22.0923 19.0809 22.4752 17.6953 21.797C16.3448 20.7356 15.0011 19.6652 13.6641 18.586C12.782 19.3821 11.907 20.1868 11.0391 21.0001C10.04 21.8143 9.07903 21.7752 8.15625 20.8829C8.02819 20.7076 7.91878 20.5201 7.82812 20.3204C7.04353 18.0838 6.25448 15.8494 5.46094 13.6173C3.94089 13.1861 2.42527 12.7408 0.914062 12.2813C0.482264 12.0916 0.169763 11.787 -0.0234375 11.3673C-0.0234375 11.1642 -0.0234375 10.961 -0.0234375 10.7579C0.187808 10.275 0.547181 9.93905 1.05469 9.7501C7.94166 7.11591 14.8323 4.4909 21.7266 1.8751C22.841 1.58058 23.591 1.9634 23.9766 3.02354ZM22.3359 3.21104C22.3932 3.2358 22.4478 3.26705 22.5 3.30479C22.5313 3.47666 22.5313 3.64853 22.5 3.82041C21.4063 9.22665 20.3125 14.6329 19.2188 20.0392C19.1327 20.7115 18.828 20.8443 18.3047 20.4376C16.0547 18.6251 13.8047 16.8126 11.5547 15.0001C13.9516 12.4313 16.3657 9.87657 18.7969 7.33604C19.1457 6.92911 19.1378 6.53068 18.7734 6.14072C18.5147 6.00783 18.2491 5.99218 17.9766 6.09385C14.0078 8.12508 10.0391 10.1564 6.07031 12.1876C5.97656 12.2189 5.88281 12.2189 5.78906 12.1876C4.4719 11.8188 3.1594 11.436 1.85156 11.0392C8.67417 8.40061 15.5023 5.79122 22.3359 3.21104ZM14.7891 9.39854C13.1487 11.1405 11.5159 12.8905 9.89062 14.6485C9.50939 16.0015 9.15005 17.3609 8.8125 18.7267C8.18606 16.9568 7.56886 15.1833 6.96094 13.4063C9.55688 12.0459 12.1662 10.71 14.7891 9.39854ZM10.8984 16.3829C11.4561 16.7683 11.9873 17.1902 12.4922 17.6485C11.6946 18.4072 10.8899 19.1572 10.0781 19.8985C10.3432 18.7285 10.6167 17.5567 10.8984 16.3829Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_48_484">
                        <rect width="24" height="24" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </Link>

                <Link href={"/#"}>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <g clipPath="url(#clip0_48_487)">
                      <path
                        opacity="0.963"
                        fillRule="evenodd"
                        clipRule="evenodd"
                        d="M-0.0234375 5.33071C-0.0234375 5.23678 -0.0234375 5.14284 -0.0234375 5.04891C1.86725 5.04107 3.75787 5.04891 5.64844 5.07239C6.1845 6.5271 6.73917 7.97522 7.3125 9.41682C7.58133 10.0342 7.90945 10.6135 8.29688 11.1546C8.39245 11.2661 8.50181 11.36 8.625 11.4364C8.89683 10.9419 9.03745 10.4096 9.04688 9.83952C9.10697 8.97195 9.06009 8.11091 8.90625 7.25635C8.85314 7.03199 8.73595 6.85196 8.55469 6.71623C8.08252 6.54034 7.61377 6.36032 7.14844 6.17611C7.49794 5.88093 7.84172 5.57564 8.17969 5.26026C8.5327 5.07789 8.9077 4.96827 9.30469 4.93149C10.9008 4.77458 12.4789 4.87636 14.0391 5.23678C14.2235 5.81649 14.3173 6.41142 14.3203 7.02151C14.2801 7.95343 14.2332 8.88492 14.1797 9.81603C14.2044 10.2013 14.2435 10.5848 14.2969 10.9667C14.3213 11.1252 14.3838 11.2661 14.4844 11.3894C14.7172 11.2031 14.936 10.9996 15.1406 10.7789C16.3368 9.13333 17.2352 7.33295 17.8359 5.37768C19.8315 5.36218 21.8237 5.37782 23.8125 5.42465C23.9919 6.04738 23.9607 6.65794 23.7188 7.25635C23.5082 7.70962 23.2739 8.14801 23.0156 8.57142C22.2261 9.7152 21.4136 10.8424 20.5781 11.953C20.3801 12.2245 20.2317 12.522 20.1328 12.8454C20.1652 13.0198 20.2355 13.1764 20.3438 13.3151C20.9219 13.8943 21.5 14.4736 22.0781 15.0528C22.4914 15.5368 22.882 16.0378 23.25 16.5558C23.7845 17.3514 24.011 18.2281 23.9297 19.1859C22.3671 19.1937 20.8046 19.1859 19.2422 19.1624C18.2526 19.0776 17.4323 18.6627 16.7812 17.9178C16.3692 17.3952 15.9395 16.8864 15.4922 16.3914C15.3193 16.2109 15.1162 16.0778 14.8828 15.9922C14.7292 16.0599 14.612 16.1695 14.5312 16.3209C14.3065 16.6989 14.1659 17.106 14.1094 17.5421C14.06 18.0889 14.0365 18.6369 14.0391 19.1859C10.023 19.385 6.84338 17.8664 4.5 14.6301C3.4818 13.1541 2.60679 11.5886 1.875 9.93345C1.21809 8.40398 0.585277 6.86972 -0.0234375 5.33071ZM10.1016 6.36398C11.0037 6.29912 11.91 6.33045 12.8203 6.45791C12.843 7.5769 12.8118 8.6963 12.7266 9.81603C12.736 10.3954 12.8063 10.9669 12.9375 11.5303C13.2869 12.6799 14.0291 13.0635 15.1641 12.681C15.7656 12.2661 16.2735 11.7573 16.6875 11.1546C17.576 9.81279 18.3181 8.38815 18.9141 6.88061C20.0391 6.81801 21.1641 6.81801 22.2891 6.88061C21.981 7.44717 21.6451 7.99513 21.2812 8.52445C20.5125 9.51714 19.7781 10.5348 19.0781 11.5773C18.5492 12.4111 18.5492 13.2409 19.0781 14.0665C19.7943 14.8155 20.513 15.567 21.2344 16.3209C21.6002 16.7424 21.9205 17.1964 22.1953 17.683C21.2582 17.7377 20.3207 17.7456 19.3828 17.7064C18.8297 17.6641 18.3609 17.4449 17.9766 17.0489C17.4054 16.3118 16.7804 15.6229 16.1016 14.9824C15.1252 14.2991 14.2424 14.4009 13.4531 15.2877C12.9668 16.012 12.6933 16.8104 12.6328 17.683C10.1363 17.5555 8.06602 16.5536 6.42188 14.6771C5.59303 13.6896 4.8743 12.625 4.26562 11.4834C3.44619 9.87305 2.70401 8.22922 2.03906 6.55185C2.91351 6.50488 3.7885 6.48924 4.66406 6.50488C5.19712 8.27182 5.90808 9.96262 6.79688 11.5773C7.122 12.1222 7.56731 12.5371 8.13281 12.8219C8.90006 13.0302 9.50161 12.8032 9.9375 12.1409C10.2712 11.4609 10.4587 10.7407 10.5 9.98042C10.5705 8.93832 10.508 7.90505 10.3125 6.88061C10.2638 6.69425 10.1935 6.52202 10.1016 6.36398Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_48_487">
                        <rect width="24" height="24" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </Link>
              </div>
            </div>

            <form className={styles.form}>
              <input type="text" placeholder="Имя" className={styles.field} />
              <input
                type="text"
                placeholder="Сообщение"
                className={styles.field}
              />
              <input
                inputMode="numeric"
                placeholder="Номер телефона"
                className={styles.field}
              />

              <p className={styles.privacyPolicy}>
                Нажимая «Отправить», вы соглашаетесь с политикой
                конфиденциальности.
              </p>

              <button className={styles.button} type="submit">
                <div className={styles.background}></div>
                <span className={styles.text}>Отправить</span>
              </button>
            </form>
          </div>
        </div>
      </div>
      <footer className={styles.footer}>
        <div className={styles.top}>
          <Link className={styles.logo} href="/">
            <svg
              width="396"
              height="55"
              viewBox="0 0 396 55"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M39.101 54.7089L45.7118 33.8542H38.9648L45.5692 13.0577L29.0681 33.8542H21.4527L18.2445 13.0577L11.6467 33.8542H0L10.5578 0.582397H27.2209L30.1958 19.593L45.4071 0.582397H61.3508L51.5902 31.3501L57.7279 31.3047L39.101 54.7089Z"
                fill="white"
              />
              <path
                d="M91.0605 0C108.845 0 109.48 9.57 107.263 16.4612L106.836 17.8006C104.677 24.6012 97.9306 34.4365 80.1009 34.4365H78.0852C60.3462 34.4365 59.75 24.6012 61.8823 17.8006L62.31 16.4612C64.5071 9.52471 71.2929 0 88.9866 0H91.0605ZM94.5474 16.8235C95.5714 13.5882 95.5844 9.05882 87.1653 9.05882C78.7463 9.05882 75.9075 13.5882 74.8511 16.8235L74.6956 17.3153C73.6715 20.5506 73.6456 25.2806 82.0258 25.2806C90.4059 25.2806 93.3354 20.5376 94.34 17.3153L94.5474 16.8235Z"
                fill="white"
              />
              <path
                d="M130.479 0.582419L122.916 24.4006H142.845L139.851 33.8412H107.821L118.385 0.562988L130.479 0.582419Z"
                fill="white"
              />
              <path
                d="M163.682 14.6948L157.59 33.8865H145.814L156.371 0.608276H168.686L180.741 19.2177L186.645 0.608276H198.428L187.87 33.8865H176.269L163.682 14.6948Z"
                fill="white"
              />
              <path
                d="M207.501 33.8606H195.408L205.972 0.582397H218.066L207.501 33.8606Z"
                fill="white"
              />
              <path
                d="M232.862 34.3978C215.123 34.3978 215.532 27.4613 216.938 23.0354L217.022 22.7636H229.985C229.725 24.0189 229.337 26.7042 235.591 26.7042H235.857C241.904 26.7042 243.271 25.0931 243.725 23.6631C244.217 22.0972 243.679 20.9778 238.3 20.8419L233.685 20.706C221.371 20.486 219.628 15.8789 221.319 10.5536L221.429 10.1978C223.251 4.47127 228.3 0.135986 242.817 0.135986H244.762C260.757 0.135986 261.548 5.68127 259.999 10.5536L259.934 10.7801H247.166C247.354 9.486 247.095 7.60306 241.541 7.60306H241.204C235.831 7.60306 234.47 8.63188 234.003 10.1072C233.536 11.5825 234.165 12.5725 239.136 12.6954L243.9 12.786C256.778 13.1419 258.541 16.9013 256.668 22.8025L256.499 23.3395C254.795 28.7101 250.439 34.3913 233.996 34.3913L232.862 34.3978Z"
                fill="white"
              />
              <path
                d="M292.023 0C309.807 0 310.442 9.57 308.225 16.4612L307.798 17.8006C305.639 24.6012 298.893 34.4365 281.063 34.4365H279.047C261.308 34.4365 260.712 24.6012 262.844 17.8006L263.272 16.4612C265.469 9.52471 272.255 0 289.949 0H292.023ZM295.509 16.8235C296.533 13.5882 296.546 9.05882 288.127 9.05882C279.708 9.05882 276.87 13.5882 275.845 16.8235L275.69 17.3153C274.666 20.5506 274.64 25.2806 283.02 25.2806C291.4 25.2806 294.349 20.5182 295.354 17.2829L295.509 16.8235Z"
                fill="white"
              />
              <path
                d="M352.272 0.582397L349.679 8.81297H328.829L327.267 13.7306H347.495L344.844 22.0971H324.636L320.903 33.8606H308.809L319.373 0.582397H352.272Z"
                fill="white"
              />
              <path
                d="M367.548 9.75121H354.203L357.113 0.582397H395.857L392.947 9.75121H379.603L371.948 33.8606H359.9L367.548 9.75121Z"
                fill="white"
              />
            </svg>
          </Link>

          <nav className={styles.navigation}>
            <button
              onClick={handleScrollTo("home")}
              data-active
              className={styles.link}
            >
              Главная
            </button>
            <button onClick={handleScrollTo("about")} className={styles.link}>
              О нас
            </button>
            <button onClick={handleScrollTo("clients")} className={styles.link}>
              Наши клиенты
            </button>
            <button
              onClick={handleScrollTo("services")}
              className={styles.link}
            >
              Наши услуги
            </button>
            <button
              onClick={handleScrollTo("contacts")}
              className={styles.link}
            >
              Контакты
            </button>
          </nav>
        </div>

        <div className={styles.bottom}>
          <p>© MOLNISOFT, 2023</p>

          <nav>
            <Link href="#">Реквизиты</Link>
            <p>ИНН 454363366</p>
            <p>ОГРН 88779797954</p>
          </nav>

          <p>Политика конфиденциальности</p>
        </div>
      </footer>
    </div>
  );
}
